export const curriculumData = [
    {
        "學制": "國中",
        "科目代碼": "NS",
        "冊次代碼": 1,
        "單元代碼": 1,
        "節次代碼": 1,
        "課名": "生命現象",
        "教學重點": [
            "知道生物和非生物的區別，在於是否有生命現象",
            "知道生物生存所需的環境資源",
            "了解細胞是生物生命的基本單位",
            "了解複式顯微鏡與解剖顯微鏡的構造與基本操作方式",
            "能正確的操作複式顯微鏡觀察標本",
            "能正確的操作解剖顯微鏡觀察標本"
        ]
    },
    {
        "學制": "國中",
        "科目代碼": "NS",
        "冊次代碼": 1,
        "單元代碼": 1,
        "節次代碼": 2,
        "課名": "細胞",
        "教學重點": [
            "能分辨數種常見細胞的形態，並說出其功能。",
            "能辨認各種胞器的構造，並說出其功能",
            "比較動物與植物的細胞形態",
            "能觀察到植物的氣孔"
        ]
    },
    {
        "學制": "國中",
        "科目代碼": "NS",
        "冊次代碼": 1,
        "單元代碼": 1,
        "節次代碼": 3,
        "課名": "細胞所需的物質",
        "教學重點": [
            "了解生物細胞由水、醣類、蛋白質、脂質等分子組成；上述分子則由碳、氫、氧、氮等原子構成",
            "知道細胞所需的物質進出細胞的方式"
        ]
    },
    {
        "學制": "國中",
        "科目代碼": "NS",
        "冊次代碼": 1,
        "單元代碼": 1,
        "節次代碼": 4,
        "課名": "從細胞到個體",
        "教學重點": [
            "了解擴散作用的定義，並能指出生活實例",
            "了解滲透作用的定義，並能指出生活實例",
            "知道單細胞生物和多細胞生物的差異",
            "能舉出數種單細胞生物和多細胞生物",
            "知道多細胞生物的組成層次",
            "能說出數種動物與植物的組織和器官",
            "能說出動物消化系統、呼吸系統等器官系統的組成器官",
            "能用複式顯微鏡觀察水中的小生物"
        ]
    }
]